"""
Заадние 5.
Напишите программу, которая приветствует пользователя, выводя слово Hello, введенное имя и знаки препинания по образцу:
"""
name = input("Введите ваше имя: ")
print("Hello, " + name + "!" )
