"""
Дан список чисел. Определите, сколько в нем встречается различных чисел.
"""
print(len(set(input().split())))
