"""
Дана строка. Замените в этой строке все цифры 1 на слово one.
"""
a = input()
print(a.replace('1','one'))
