""" Задание 1
Напишите программу, которая считывает три числа и выводит их сумму. Каждое число записано в отдельной строке.
"""
a = int(input("Введите первое число: "))
b = int(itaskt("Введите второе число: "))
c = int(input("Введите третье число: "))
print("Сумма чисел = ", a + b + c)