"""
Задание 6.
По данному натуральному n вычислите сумму 1**3+2**3+3**3+...+n**3.
"""
sum = 0
n = int(input())

for i in range(1,n+1,1):
    a=i**3
    sum+=a
    i+=1
print(sum)
