"""
Задание 1.
Даны два целых числа. Выведите значение наименьшего из них.
"""
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
if a>b:
    print (b)
else:
        print (a)
