"""
Задание 2
Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь. Каждое число записано в отдельной строке.
"""
b = int(input("Введите первый катет: "))
h = int(input("Введите второй катет: "))
print(b*h*0.5)