"""
Дана строка. Удалите из этой строки все символы @.
"""
a = input()
print(a.replace("@",""))
